app/controllers/api/v1/announcements_controller.rb

  def index
    @announcements = Announcement.all
---
SELECT "announcements".* FROM "announcements"