app/controllers/api/v1/directories_controller.rb

SELECT "directories".* FROM "directories"
---
  def index
    @directories = Directory.all

SELECT "directories".* FROM "directories" WHERE "directories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_directory
      @directory = Directory.find(params[:id])