app/controllers/api/v1/organizations_controller.rb

  def index
    if logged_in?
      @organizations = Organization.all.by_name
---
SELECT "organizations".* FROM "organizations"

    def set_organization
      @organization = Organization.find(params[:id])
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]