app/controllers/api/v1/sessions_controller.rb

  def create
    @user = User.find_by(email: params[:session][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "lgworldcom@gmail.com"], ["LIMIT", 1]]