app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("firstname", "lastname", "title", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    # @user.destroy
    @user = User.find(params[:id])